# IsParameterModifiable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Subelement..::..IsParameterModifiable Method
Subelement Class See Also
---
Checks if given parameter of this subelement is modifiable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsParameterModifiable(
	ElementId parameterId
)
```

Visual Basic
---
```text
Public Function IsParameterModifiable ( _
	parameterId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsParameterModifiable(
	ElementId^ parameterId
)
```

# ### Parameters
parameterId
    Type: Autodesk.Revit.DB..::..ElementId Parameter id.
# ### Return Value
True if given parameter of this subelement is modifiable, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Subelement Class
Autodesk.Revit.DB Namespace